    Pandas, Python programlama dili için yüksek performanslı, kullanımı kolay veri yapıları ve veri analizi araçları sağlayan, açık kaynaklı, BSD lisanslı bir kütüphanedir.
    Proje ana sayfası: https://pandas.pydata.org/

In [1]:
import pandas as pd

# Pandas ile Veri Okuma

## Github verisini okuma

In [3]:
df_github = pd.read_csv("https://raw.githubusercontent.com/erkansirin78/datasets/master/simple_data.csv")

In [4]:
df_github.head()

   sirano     isim  yas       meslek     sehir  aylik_gelir
0       1    Cemal   35         Isci    Ankara         3500
1       2    Ceyda   42        Memur   Kayseri         4200
2       3    Timur   30     Müzisyen  Istanbul         9000
3       4    Burcu   29  Pazarlamaci    Ankara         4200
4       5  Yasemin   23          NaN     Bursa         4800

## Diskten veri okuma (notebook ile aynı dizinde)

In [6]:
df_from_disk = pd.read_csv("simple_data.csv")

In [7]:
df_from_disk.head()

   sirano     isim  yas       meslek     sehir  aylik_gelir
0       1    Cemal   35         Isci    Ankara         3500
1       2    Ceyda   42        Memur   Kayseri         4200
2       3    Timur   30     Müzisyen  Istanbul         9000
3       4    Burcu   29  Pazarlamaci    Ankara         4200
4       5  Yasemin   23          NaN     Bursa         4800

## Diskten veri okuma (notebook ile farklı dizinde)

In [8]:
df_dfrom_disk2 = pd.read_csv("D:/Datasets/simple_data.csv")

In [9]:
df_dfrom_disk2.head()

   sirano     isim  yas       meslek     sehir  aylik_gelir
0       1    Cemal   35         Isci    Ankara         3500
1       2    Ceyda   42        Memur   Kayseri         4200
2       3    Timur   30     Müzisyen  Istanbul         9000
3       4    Burcu   29  Pazarlamaci    Ankara         4200
4       5  Yasemin   23          NaN     Bursa         4800

## Diskten veri okuma virgülden farklı ayraç

In [12]:
df_from_disk3 = pd.read_csv("simple_data.csv", sep=";")

In [13]:
df_from_disk3.head()

   sirano     isim  yas       meslek     sehir  aylik_gelir
0       1    Cemal   35         Isci    Ankara         3500
1       2    Ceyda   42        Memur   Kayseri         4200
2       3    Timur   30     Müzisyen  Istanbul         9000
3       4    Burcu   29  Pazarlamaci    Ankara         4200
4       5  Yasemin   23          NaN     Bursa         4800

In [2]:
# df = pd.read_csv("https://raw.githubusercontent.com/erkansirin78/datasets/master/simple_data.csv")
df = pd.read_csv("D:/Datasets/simple_data.csv")

In [3]:
df.head()

   sirano     isim  yas       meslek     sehir  aylik_gelir
0       1    Cemal   35         Isci    Ankara         3500
1       2    Ceyda   42        Memur   Kayseri         4200
2       3    Timur   30     Müzisyen  Istanbul         9000
3       4    Burcu   29  Pazarlamaci    Ankara         4200
4       5  Yasemin   23          NaN     Bursa         4800

In [14]:
# Okuyacağımız veriyi çalışma diznine taşırsak sadece veri dosyası ismi kullanmak yeterlidir.
# Bulunduğumuz çalışma diznini aşağıdaki kodlarla öğrenebiliriz.
import os
os.getcwd()

'D:\\egitim\\verilen\\machine-learning-with-python\\02_pandas'

In [15]:
# Veri setini çalışma diznine taşımamış isek path belirtmek gerekir. 
# Ayrıca veri ayracının ne olduğu ve encodingin ne olduğuna da dikkat etmek gerekir (utf-8)
# Encoding Notepad++ üzerinden Encoding -> Convert to UTF8 veya notepad ile farklı kaydetme esnasında değiştirilebilir.

df = pd.read_csv("D:\\Datasets\\Mall_Customers.csv", sep=",")

In [16]:
df.head(7)

   CustomerID  Gender  Age  AnnualIncome  SpendingScore
0           1    Male   19         15000             39
1           2    Male   21         15000             81
2           3  Female   20         16000              6
3           4  Female   23         16000             77
4           5  Female   31         17000             40
5           6  Female   22         17000             76
6           7  Female   35         18000              6

# Pandas Dataframe Şekli, Boyutu

In [17]:
df.shape

(200, 5)

In [18]:
df.tail()

     CustomerID  Gender  Age  AnnualIncome  SpendingScore
195         196  Female   35        120000             79
196         197  Female   45        126000             28
197         198    Male   32        126000             74
198         199    Male   32        137000             18
199         200    Male   30        137000             83

# Dataframe hakkında daha detaylı bilgi

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
CustomerID       200 non-null int64
Gender           200 non-null object
Age              200 non-null int64
AnnualIncome     200 non-null int64
SpendingScore    200 non-null int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

In [20]:
df.describe()

       CustomerID         Age   AnnualIncome  SpendingScore
count  200.000000  200.000000     200.000000     200.000000
mean   100.500000   38.850000   60560.000000      50.200000
std     57.879185   13.969007   26264.721165      25.823522
min      1.000000   18.000000   15000.000000       1.000000
25%     50.750000   28.750000   41500.000000      34.750000
50%    100.500000   36.000000   61500.000000      50.000000
75%    150.250000   49.000000   78000.000000      73.000000
max    200.000000   70.000000  137000.000000      99.000000

# Okurken sütun seçmek, sep ve header

In [11]:
# sep="," niteliklerin birbirinden virgülile ayrılacağını söyler. Varsayılan virgüldür.
# Farklı bir ayraç için mutlaka bu parametre kullanılmalıdır.

In [21]:
df2 = pd.read_csv("D:/Datasets/Mall_Customers.csv",
                sep=",",
                header=0,
                usecols=["Gender","Age"])

# dataframe okurken başlık (header) yok ise header = None kullanmalıyız.

In [23]:
df2.head()

   Gender  Age
0    Male   19
1    Male   21
2  Female   20
3  Female   23
4  Female   31

# Sütun İsimlerini Değiştirmek

In [24]:
df.columns

Index(['CustomerID', 'Gender', 'Age', 'AnnualIncome', 'SpendingScore'], dtype='object')

In [25]:
new_cols = [i.upper() for i in df.columns]
new_cols

['CUSTOMERID', 'GENDER', 'AGE', 'ANNUALINCOME', 'SPENDINGSCORE']

In [33]:
new_cols2 = ['CUSTOMERID', 'GENDER', 'AGE', 'ANNUALINCOME', 'SPENDINGSCORE']

In [34]:
df.columns = new_cols2
df.head()

   CUSTOMERID  GENDER  AGE  ANNUALINCOME  SPENDINGSCORE
0           1    Male   19         15000             39
1           2    Male   21         15000             81
2           3  Female   20         16000              6
3           4  Female   23         16000             77
4           5  Female   31         17000             40

# Sütunları Seçmek

In [36]:
df['SPENDINGSCORE'].head()

0    39
1    81
2     6
3    77
4    40
Name: SPENDINGSCORE, dtype: int64

In [37]:
df.SPENDINGSCORE.head()

0    39
1    81
2     6
3    77
4    40
Name: SPENDINGSCORE, dtype: int64

#  Birden fazla sütunu seçmek (liste içinde seçmeyi unutmayın!!!)

In [38]:
df[['ANNUALINCOME','SPENDINGSCORE']].head()

   ANNUALINCOME  SPENDINGSCORE
0         15000             39
1         15000             81
2         16000              6
3         16000             77
4         17000             40

# Mevcut Bir Sutünun Değerlerini Değiştirmek
<h4 style="color:red; font-size:1.3em;";>sütun ismi mevcutlardan biri ise onun üzerine günceller. Farklı ise yeni bir sütun oluşturur.</h4>

In [39]:
df['ANNUALINCOME2'] = df.ANNUALINCOME * 1000

In [50]:
satir = list(range(2,5))
df.loc[satir][["GENDER","ANNUALINCOME"]].head()

   GENDER  ANNUALINCOME
2  Female          16.0
3  Female          16.0
4  Female          17.0

In [51]:
df.iloc[:,[0,1]].head()

   CUSTOMERID  GENDER
0           1    Male
1           2    Male
2           3  Female
3           4  Female
4           5  Female

In [41]:
df['ANNUALINCOME'] = df.ANNUALINCOME / 1000

In [42]:
df.head()

   CUSTOMERID  GENDER  AGE  ANNUALINCOME  SPENDINGSCORE  ANNUALINCOME2
0           1    Male   19          15.0             39       15000000
1           2    Male   21          15.0             81       15000000
2           3  Female   20          16.0              6       16000000
3           4  Female   23          16.0             77       16000000
4           5  Female   31          17.0             40       17000000

# Yeni Sütun Eklemek

In [43]:
df['ANNUALINCOMETL'] = df.ANNUALINCOME * 6.0

In [44]:
df.head()

,CUSTOMERID,GENDER,AGE,ANNUALINCOME,SPENDINGSCORE,ANNUALINCOME2,ANNUALINCOMETL
0,1,Male,19,15.0,39,15000000,90.0
1,2,Male,21,15.0,81,15000000,90.0
2,3,Female,20,16.0,6,16000000,96.0
3,4,Female,23,16.0,77,16000000,96.0
4,5,Female,31,17.0,40,17000000,102.0

In [26]:
df.shape

(200, 7)

# Kategorik Değişken Üreterek Yeni Sütun Yaratmak pd.cut()

In [54]:
df = pd.read_csv("D:/Datasets/Mall_Customers.csv")

In [56]:
df.head()

   CustomerID  Gender  Age  AnnualIncome  SpendingScore
0           1    Male   19         15000             39
1           2    Male   21         15000             81
2           3  Female   20         16000              6
3           4  Female   23         16000             77
4           5  Female   31         17000             40

In [57]:
# Yıllık 40K'dan küçükse low, 40K-100K arası middle, 100K üzeri high olsun

op_labels = ['low', 'middle', 'high']
category = [0,40000,100000,150000]
df['INCOMECAT'] = pd.cut(df['AnnualIncome'], labels=op_labels, 
                         bins=category, include_lowest=False)

In [65]:
df[df.INCOMECAT == 'middle'].head()

,CustomerID,Gender,Age,AnnualIncome,SpendingScore,INCOMECAT,ANN-INCOMECAT
50,51,Female,49,42000,52,middle,42000 - middle
51,52,Male,33,42000,60,middle,42000 - middle
52,53,Female,31,43000,54,middle,43000 - middle
53,54,Male,59,43000,60,middle,43000 - middle
54,55,Female,50,43000,45,middle,43000 - middle

# Sütunları Birleştirmek

In [62]:
df['ANN-INCOMECAT'] = df['AnnualIncome'] + ' - ' + df['INCOMECAT']

UFuncTypeError: ufunc 'add' did not contain a loop with signature matching types (dtype('<U21'), dtype('<U21')) -> dtype('<U21')

In [63]:
# int ile string birleşmez.
df['ANN-INCOMECAT'] = df['AnnualIncome'].astype(str) + ' - ' + df['INCOMECAT'].astype(str)

In [64]:
df.head()

,CustomerID,Gender,Age,AnnualIncome,SpendingScore,INCOMECAT,ANN-INCOMECAT
0,1,Male,19,15000,39,low,15000 - low
1,2,Male,21,15000,81,low,15000 - low
2,3,Female,20,16000,6,low,16000 - low
3,4,Female,23,16000,77,low,16000 - low
4,5,Female,31,17000,40,low,17000 - low

# Her satır için benzersiz bir id oluşturmak

In [66]:
# Kaç satır var?
len(df)

200

In [71]:
ID = range(100,300)
len(ID)

200

In [72]:
df['ID'] = ID
df.head()

,CustomerID,Gender,Age,AnnualIncome,SpendingScore,INCOMECAT,ANN-INCOMECAT,ID
0,1,Male,19,15000,39,low,15000 - low,100
1,2,Male,21,15000,81,low,15000 - low,101
2,3,Female,20,16000,6,low,16000 - low,102
3,4,Female,23,16000,77,low,16000 - low,103
4,5,Female,31,17000,40,low,17000 - low,104

# Sütunları Yeniden Adlandırmak

In [73]:
sutun_degisimi = {'ID':'ROWID'}
df.rename(columns=sutun_degisimi, inplace=True)
# inplace=True demek bu değişimi bellekte gerçekleştir.
# inplace=True işleminin geri dönüşü yoktur. Veriyi baştan okumak gerekir.

In [74]:
df.head()

,CustomerID,Gender,Age,AnnualIncome,SpendingScore,INCOMECAT,ANN-INCOMECAT,ROWID
0,1,Male,19,15000,39,low,15000 - low,100
1,2,Male,21,15000,81,low,15000 - low,101
2,3,Female,20,16000,6,low,16000 - low,102
3,4,Female,23,16000,77,low,16000 - low,103
4,5,Female,31,17000,40,low,17000 - low,104

# Sütunların Sırasını Değiştirmek

In [36]:
# ROWID'yi en başa almak istiyorum

In [76]:
df.columns

Index(['CustomerID', 'Gender', 'Age', 'AnnualIncome', 'SpendingScore',
       'INCOMECAT', 'ANN-INCOMECAT', 'ROWID'],
      dtype='object')

In [77]:
df = df[['ROWID','CustomerID', 'Gender', 'Age', 'AnnualIncome', 'SpendingScore',
       'INCOMECAT', 'ANN-INCOMECAT']]

In [78]:
df.head()

,ROWID,CustomerID,Gender,Age,AnnualIncome,SpendingScore,INCOMECAT,ANN-INCOMECAT
0,100,1,Male,19,15000,39,low,15000 - low
1,101,2,Male,21,15000,81,low,15000 - low
2,102,3,Female,20,16000,6,low,16000 - low
3,103,4,Female,23,16000,77,low,16000 - low
4,104,5,Female,31,17000,40,low,17000 - low

<h1 style="color:blue;";> 02_pandas: alıştırma - 1</h1>

<p style="font-size:1.5em";> simple_data.csv verisini kullanarak;</p>
<ol style="font-size:1.5em";>
    <li> Sütun isimlerini BÜYÜK HARFLİ yapınız</li>
<li>Yeni bir sütun içinde meslek,sehir sütunlarını aralarında çizgi 
olacak şekilde birleştiriniz.</li>
<li>aylik_gelir'i dolar cinsinden hesaplayarak aylik_gelir_dolar ismiyle 
   yeni bir sütun ekleyiniz.</li>
<li>3801'den başlayacak şekilde; <br>** 3802, 3803... artarak her bir satıra 
id numarası veriniz (yeni bir sütun içinde)<br>
** aylik_geliri baz alarak 0-2500 arasını düşük, 2500-7500 arasını orta ve 
7500 üstünü yüksek olacak şekilde <br>
** kategorilendirip gelir_kategori ismiyle yeni bir sütun olarak ekleyiniz.</li>
    </ol>